# Quiz 1 Solution Calculator

### Load Solution Code

In [13]:
import pandas as pd
import numpy as np

def rangeMag(df_in, columnName):
    usedColumn = df_in[columnName]
    tmpMax = usedColumn.max()
    tmpMin = usedColumn.min()
    retVal = tmpMax-tmpMin
    return retVal

def earnedAbove(df_in, amount, columnName):
    usedColumn = df_in[columnName]
    biggerList = usedColumn[usedColumn>amount]
    retVal = biggerList.size
    return retVal/usedColumn.size

def difference_74_78(df_in, column_low, column_high):
    incomes = df_in[[column_low, column_high]]
    a = (incomes[column_high] - incomes[column_low])
    retVal = np.mean(a)
    return retVal

def ageCount(df_in, columnName, low_age, high_age):
    numData = pd.to_numeric(df_in[columnName], errors='raise')
    numData = np.array(numData)
    data1 = numData[np.where((numData <= high_age) & (numData >= low_age))]
    retVal = data1.size
    return retVal

def cohort(df_in, cohort1, cohort2, cohort3, earningsColumn):
    df_in["Cohort"] = (df_in[cohort1]+df_in[cohort2]+df_in[cohort3])
    cohortList = df_in["Cohort"].unique()
    i = 0
    resList = []
    lowest = -1
    while i < cohortList.size:
        tmp = df_in[df_in.Cohort == cohortList[i]]
        cohortMed = np.median(pd.to_numeric(tmp[earningsColumn]))
        tmpTuple = (cohortList[i], cohortMed)
        resList.append(tmpTuple)
        if ((cohortMed < lowest) | (lowest == -1)):
            lowest = cohortMed
        i = i + 1
    return lowest

### Load Data

In [14]:
df = pd.read_csv("LabourTrainingEvaluationData.csv")
df.head()

,Age,Eduacation,Race,Hisp,MaritalStatus,Nodeg,Earnings_1974,Earnings_1975,Earnings_1978
0,45,LessThanHighSchool,NotBlack,NotHispanic,Married,1,21516.670,25243.550,25564.670
1,21,Intermediate,NotBlack,NotHispanic,NotMarried,0,3175.971,5852.565,13496.080
2,38,HighSchool,NotBlack,NotHispanic,Married,0,23039.020,25130.760,25564.670
3,48,LessThanHighSchool,NotBlack,NotHispanic,Married,1,24994.370,25243.550,25564.670
4,18,LessThanHighSchool,NotBlack,NotHispanic,Married,1,1669.295,10727.610,9860.869

In [15]:
df.describe()

                Age         Nodeg  Earnings_1974  Earnings_1975  Earnings_1978
count  15992.000000  15992.000000   15992.000000   15992.000000   15992.000000
mean      33.225238      0.295835   14016.800304   13650.803376   14846.659673
std       11.045216      0.456432    9569.795893    9270.403225    9647.391524
min       16.000000      0.000000       0.000000       0.000000       0.000000
25%       24.000000      0.000000    4403.452250    4398.823000    5669.298000
50%       31.000000      0.000000   15123.580000   14557.110000   16421.975000
75%       42.000000      1.000000   23584.180000   22923.737500   25564.670000
max       55.000000      1.000000   25862.320000   25243.550000   25564.670000

### Question 1 - 4

Question text: "What is the magnitude of the range of the column "

In [16]:
# Nodeg
print(rangeMag(df, "Nodeg"))
# Earnings_1974
print(rangeMag(df, "Earnings_1974"))
# Earnings_1975
print(rangeMag(df, "Earnings_1975"))
# Earnings_1978
print(rangeMag(df, "Earnings_1978"))

1
25862.32
25243.55
25564.67

### Question 5-7

In [17]:
# 1974, $20,000
print(earnedAbove(df, 20000, "Earnings_1974"))
# 1978, $25,000
print(earnedAbove(df, 25000, "Earnings_1978"))
# 1978, 1978 median
print(earnedAbove(df, np.median(df["Earnings_1975"]), "Earnings_1978"))

0.35767883941970985
0.272823911955978
0.5521510755377689

### Question 8-9

Question text: "What is the mean of the differences between "?

In [19]:
# Earnings_1975 and Earnings_1974
print(difference_74_78(df, "Earnings_1974", "Earnings_1975"))
# Earnings_1978 and Earnings_1974
print(difference_74_78(df, "Earnings_1974", "Earnings_1978"))

-365.9969281194821
829.8593687151432

### Question 10-12

Question text: "How many values in the column fall within the range "?

In [20]:
# 1974, 10,000 and 15,0000
print(ageCount(df, "Earnings_1974", 10000, 15000))
# Age, 18 and 49
print(ageCount(df, "Age", 18, 49))
# 1974, 1978 mean and median
df_tmp = df[df["Age"] >= 20]
df_tmp = df_tmp[df_tmp["Age"] < 30]
print(ageCount(df_tmp, "Earnings_1978", np.mean(df["Earnings_1978"]), np.median(df["Earnings_1978"])))

2054
13468
297

### Question 13-14

You'll need to order them manually. You could make a list or df and sort, but there's only 3

In [21]:
print(np.std(df["Earnings_1974"]))
print(np.std(df["Earnings_1975"]))
print(np.std(df["Earnings_1978"]))

9569.496682978854
9270.113375306588
9647.089887839367

In [22]:
print(np.mean(df["Earnings_1974"])-np.median(df["Earnings_1974"]))
print(np.mean(df["Earnings_1975"])-np.median(df["Earnings_1975"]))
print(np.mean(df["Earnings_1978"])-np.median(df["Earnings_1978"]))

-1106.779695808831
-906.3066239268392
-1575.3153270939874

### Question 15-16

Question text: "What is the lowest median earnings in of cohorts defined by their "?

In [23]:
# RACE, HISP, and MARITALSTATUS, 1978
print(cohort(df, "Race", "Hisp", "MaritalStatus", "Earnings_1978"))
# EDUCATION, RACE, HISP, 1974
print(cohort(df, "Eduacation", "Race", "Hisp", "Earnings_1974"))

7862.983
8398.397